# running in crossbar_controller_task1/src/

read -formal crossbar_controller.v

prep -top crossbar_controller

hierarchy -smtcheck
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
